app/views/currencies/index.html.erb

SELECT "cryptocurrencies"."id" FROM "cryptocurrencies"
---
        <%mercadito = Exchange.find_by(name: "BitTrex")%>
        <%@monedas = mercadito.cryptocurrencies.each do |t|%>

SELECT "exchanges".* FROM "exchanges"
---
        <%moneda = Cryptocurrency.find_by(name: "Ethereum")%>
        <%@mercados = moneda.exchanges.each do |t| %>