app/controllers/currencies_controller.rb

SELECT "exchanges".* FROM "exchanges"
SELECT "cryptocurrencies"."id" FROM "cryptocurrencies"
---
  def index
    #@coinsnap = Hashie::Mash.new(Cryptocompare::CoinSnapshot.find('ETH', 'USD'))
    @symbols = Hashie::Mash.new(Cryptocompare::CoinList.all)
    @exchanges = Hashie::Mash.new(Cryptocompare::Exchanges.all)
    @exchangeName = Exchange.all
    @currencies = Cryptocurrency.all

SELECT  "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = $1 LIMIT $2  [["id", 122], ["LIMIT", 1]]
---
  def show
    @currencies = Cryptocurrency.find(params[:id])