app/controllers/exchanges_controller.rb

  def index
    @exchange = Exchange.all

    @exchange.where(name: 'Coinbase')
---
SELECT "exchanges".* FROM "exchanges"
SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."name" = $1 LIMIT $2  [["name", "Bittrex"], ["LIMIT", 1]]

  def show
    @exchange = Exchange.find(params[:id])
---
SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = $1 LIMIT $2  [["id", 172], ["LIMIT", 1]]